//Задача No18. Общее обсуждение
//Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).

using Sem3ex1;
string coordinate = SystemCoordinate.GetNumberOfQuarter(1);
Console.WriteLine(coordinate);