//Задача No21. Работа в группах
//Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
//● A (3,6); B (2,1) -> 5,09
//● A (7,-5); B (1,-1) -> 7,21

//public static double Sqrt (double d);

using Sem2ex3;
double s = Distance.Sqrt(3, 6, 2, 1);
Console.WriteLine(s);